import pandas as pd
import numpy as np

url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
chipo = pd.read_csv(url, sep='\t')
print(chipo)

"""
1. 10개의 행 확인
2. 데이터셋에는 몇 개의 관측치 확인(행 갯수 확인)
3. 열의 이름을 확인
4. 인덱스를 확인
"""
print("\n#############################################################################################################################################")
print(chipo.head(10))

print("\n#############################################################################################################################################")
print(chipo.info())
print(chipo.shape) # 행과 열

print("\n#############################################################################################################################################")
print(chipo.columns)

print("\n#############################################################################################################################################")
print(chipo.index)

print("\n#############################################################################################################################################")
print(chipo.groupby("item_name").sum().sort_values("quantity", ascending=False).head(1))

print("\n#############################################################################################################################################")
df = chipo.groupby("choice_description").sum()
df = df.sort_values("quantity", ascending=False)
print(df.head(1))

print("\n#########총주문량####################################################################################################################")
c = chipo.groupby("order_id").sum()
print(c.sum())

print("\n#########아이템의 가격은 어떤 타입#################################################################################################################")
print(chipo.dtypes)

print("\n###########아이템의 가격을 부동소수점 타입으로#############################################################################################################")
#chipo['item_price'] = chipo.item_price.transform(lambda x : float(x.strip("$")))
dollor = lambda x : float(x[1:])
chipo['item_price'] = chipo.item_price.apply(dollor)
print(chipo.dtypes)

print("\n############수익########################################################################################################")
revenue = (chipo.item_price * chipo.quantity).sum()
print(revenue)

print("\n###########주문자##################################################################################################################")
#print(chipo.groupby("order_id").sum())
orders = chipo.order_id.value_counts().count() #value_counts()
print(orders)

print("\n#########주문자당 평균 지출 금액##########################################################################################################################")
print(revenue/orders)
chipo['revenue'] = chipo['quantity'] * chipo['item_price']

order_grouped = chipo.groupby("order_id").sum()

print(order_grouped.mean())

print("\n############얼마다 다른 아이템이 팔렷나############################################################################################################")
print(chipo.item_name.value_counts().count())
